# +- архитектура скрипта:
# 1. Импорт необходимых библиотек:
# - numpy для генерации случайных чисел
# - pandas для работы с данными и сохранения в файл
# - random для генерации случайных чисел и строк
# - datetime для генерации случайных дат
# - faker для генерации фейковых данных (имена, адреса и т.д.)

# 2. Определение функции для генерации данных
# - определение констант для количества строк и типов данных
# - генерация пользовательских данных (имя, возраст, адрес, дата регистрации и т.д.)
# - создание DataFrame из сгенерированных данных
# - возвращение DataFrame с сгенерированными данными
# 3. Вызов функции генерации данных и сохранение в файл
